;
function createCityBar() {
  var cities = [{
      "cityList": ["北京", "上海", "广州", "深圳", "成都", "杭州"],
      "name": "热门城市",
      "nameStr": "热门城市"
    },
    {
      "cityList": [
        "安庆",
        "蚌埠",
        "保定",
        "北京",
        "毕节",
        "包头",
        "长春",
        "成都",
        "赤峰",
        "重庆",
        "长沙",
        "常州",
        "沧州",
        "潮州",
        "郴州",
        "东莞",
        "大连",
        "大庆",
        "大同",
        "德阳",
        "德州",
        "达州",
        "鄂州",
        "佛山",
        "阜阳",
        "福州",
        "&nbsp;"
      ],
      "name": "",
      "nameStr": "ABCDEF"
    },
    {
      "cityList": [
        "桂林",
        "贵阳",
        "广州",
        "赣州",
        "淮安",
        "邯郸",
        "哈尔滨",
        "合肥",
        "呼和浩特",
        "海口",
        "黄石",
        "衡水",
        "海外",
        "河源",
        "衡阳",
        "杭州",
        "惠州",
        "湖州",
        "菏泽",
        "吉安",
        "金华",
        "吉林",
        "江门",
        "济南",
        "济宁",
        "嘉兴",
        "晋中",
        "焦作",
        "荆州",
        "&nbsp;"
      ],
      "name": "",
      "nameStr": "GHIJ"
    },
    {
      "cityList": [
        "开封",
        "昆明",
        "六安",
        "聊城",
        "廊坊",
        "吕梁",
        "拉萨",
        "乐山",
        "丽水",
        "洛阳",
        "临沂",
        "龙岩",
        "兰州",
        "柳州",
        "泸州",
        "马鞍山",
        "茂名",
        "眉山",
        "绵阳",
        "梅州",
        "宁波",
        "南昌",
        "南充",
        "南京",
        "南宁",
        "南通",
        "南阳"
      ],
      "name": "",
      "nameStr": "KLMN"
    },
    {
      "cityList": [
        "平顶山",
        "莆田",
        "萍乡",
        "濮阳",
        "青岛",
        "秦皇岛",
        "齐齐哈尔",
        "清远",
        "泉州",
        "衢州",
        "日照",
        "&nbsp;"
      ],
      "name": "",
      "nameStr": "OPQR"
    },
    {
      "cityList": [
        "韶关",
        "上海",
        "石家庄",
        "宿迁",
        "商丘",
        "上饶",
        "汕头",
        "汕尾",
        "绍兴",
        "沈阳",
        "三亚",
        "深圳",
        "苏州",
        "深圳市",
        "天津",
        "唐山",
        "太原",
        "台州"
      ],
      "name": "",
      "nameStr": "STUV"
    },
    {
      "cityList": [
        "潍坊",
        "武汉",
        "芜湖",
        "威海",
        "乌鲁木齐",
        "无锡",
        "温州",
        "西安",
        "许昌",
        "孝感",
        "香港特别行政区",
        "厦门",
        "西宁",
        "邢台",
        "新乡",
        "咸阳",
        "襄阳",
        "信阳",
        "徐州",
        "宜宾",
        "银川",
        "盐城",
        "宜昌",
        "宜春",
        "运城",
        "榆林",
        "烟台",
        "岳阳",
        "扬州",
        "淄博",
        "珠海",
        "镇江",
        "湛江",
        "张家口",
        "肇庆",
        "中山",
        "遵义",
        "郑州",
        "株洲",
        "漳州",
        "枣庄",
        "&nbsp;"
      ],
      "name": "",
      "nameStr": "WXYZ"
    }
  ];

  var cityHtml = '';
  var cityItemHtml = '';

  for (var i = 0 ; i < cities.length; i++){
    cityHtml = '';
    for (var j = 0; j < cities[i].cityList.length; j++) {
      cityHtml += `<p class="item">${cities[i].cityList[j]}</p> `;
    };
    cityItemHtml += `
      <div class="someCityBox">
                <h5>${cities[i].nameStr}</h5>
                <div class="someCity">
                    ${cityHtml}
                </div>
            </div>
      `;
  };

  // console.log(cityItemHtml);

  $('.wrap').html(cityItemHtml);
  
  
};